Ran Apply for dir: `stag` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
running "terraform apply --auto-approve" in "/home/sysadmin/.atlantis/repos/khatib-moh/test/81/default/stag": exit status 1: running "terraform apply --auto-approve" in "/home/sysadmin/.atlantis/repos/khatib-moh/test/81/default/stag": 

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.example_vm will be created
  + resource "proxmox_vm_qemu" "example_vm" {
      + additional_wait           = 5
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + clone                     = "debian-11.5.0-amd64-1.0"
      + clone_wait                = 10
      + cores                     = 1
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 512
      + name                      = "ATLANTIS-TESTi"
      + nameserver                = (known after apply)
      + onboot                    = false
      + oncreate                  = true
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "lsi"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "var.target_node"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
proxmox_vm_qemu.example_vm: Creating...
╷
│ Error: 400 Parameter verification failed.
│ 
│   with proxmox_vm_qemu.example_vm,
│   on main.tf line 22, in resource "proxmox_vm_qemu" "example_vm":
│   22: resource "proxmox_vm_qemu" "example_vm" {
│ 
╵

now applying

```
</details>